iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H747I-EVAL/stm32h747i_eval.c
/**
  ******************************************************************************
  * @file    stm32h747i_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons
  *          Joystick
  *          POT
  *          COM ports
  *          available on STM32H747I_EVAL board(MB1246) from STMicroelectronics.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h747i_eval.h"

#if (USE_BSP_IO_CLASS > 0U)
#include "stm32h747i_eval_io.h"
#endif
/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32H747I_EVAL
  * @{
  */

/** @defgroup STM32H747I_EVAL_LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup STM32H747I_EVAL_LOW_LEVEL_Private_TypesDefinitions LOW LEVEL Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback) (void);
/**
  * @}
  */

/** @defgroup STM32H747I_EVAL_LOW_LEVEL_Private_FunctionPrototypes  LOW LEVEL Private Function Prototypes
  * @{
  */
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
static void BUTTON_USER_EXTI_Callback(void);
#if (USE_BSP_COM_FEATURE > 0)
static void USART1_MspInit(UART_HandleTypeDef *huart);
static void USART1_MspDeInit(UART_HandleTypeDef *huart);
#endif
#if (USE_BSP_POT_FEATURE > 0)
static void ADC1_MspInit(ADC_HandleTypeDef *hadc);
static void ADC1_MspDeInit(ADC_HandleTypeDef *hadc);
#endif
#if (USE_BSP_JOY_FEATURE > 0)
static void JOY1_EXTI_Callback(void);
#endif

/**
  * @}
  */
/** @defgroup STM32H747I_EVAL_LOW_LEVEL_Exported_Variables LOW LEVEL Exported Variables
  * @{
  */
static EXTI_HandleTypeDef hpb_exti [BUTTONn];
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
USART_TypeDef* COM_USART[COMn]   = {COM1_UART};
#endif
#if (USE_BSP_POT_FEATURE > 0)
ADC_HandleTypeDef hpot_adc[POTn];
#endif

/**
  * @}
  */
/** @defgroup STM32H747I_EVAL_LOW_LEVEL_Private_Variables LOW LEVEL Private Variables
  * @{
  */
static GPIO_TypeDef* LED_PORT[LEDn] = {
                                       LED1_GPIO_PORT,
                                       LED2_GPIO_PORT,
                                       LED3_GPIO_PORT,
                                       LED4_GPIO_PORT
                                      };
static const uint32_t LED_PIN[LEDn] = {LED1_PIN,
                                       LED2_PIN,
                                       LED3_PIN,
                                       LED4_PIN};

static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {BUTTON_WAKEUP_GPIO_PORT,
                                             BUTTON_TAMPER_GPIO_PORT,
                                             BUTTON_USER_GPIO_PORT
                                            };
static const uint16_t BUTTON_PIN[BUTTONn] = {BUTTON_WAKEUP_PIN,
                                             BUTTON_TAMPER_PIN,
                                             BUTTON_USER_PIN
                                            };
static const IRQn_Type BUTTON_IRQn[BUTTONn] = {BUTTON_WAKEUP_EXTI_IRQn,
                                               BUTTON_TAMPER_EXTI_IRQn,
                                               BUTTON_USER_EXTI_IRQn
                                              };
#if (USE_BSP_COM_FEATURE > 0)
  #if (USE_COM_LOG > 0)
    static COM_TypeDef COM_ActiveLogPort = COM1;
  #endif
  #if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    static uint32_t IsComMspCbValid[COMn] = {0};
  #endif
#endif

#if (USE_BSP_POT_FEATURE > 0)
  #if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    static uint32_t IsAPotMspCbValid[POTn] = {0};
  #endif
#endif
#if (USE_BSP_JOY_FEATURE > 0)
#if (USE_BSP_IO_CLASS > 0)
static const uint16_t JOY_SEL_PIN[JOYn]   = {JOY1_SEL_PIN};
static const uint16_t JOY_DOWN_PIN[JOYn]  = {JOY1_DOWN_PIN};
static const uint16_t JOY_LEFT_PIN[JOYn]  = {JOY1_LEFT_PIN};
static const uint16_t JOY_RIGHT_PIN[JOYn] = {JOY1_RIGHT_PIN};
static const uint16_t JOY_UP_PIN[JOYn]    = {JOY1_UP_PIN};
static const uint16_t JOY_ALL_PIN[JOYn]   = {JOY1_ALL_PIN};
#endif
static uint32_t JoyPinsMask;
static EXTI_HandleTypeDef hjoy_exti[JOYn];
#endif
/**
  * @}
  */

/** @addtogroup STM32H747I_EVAL_LOW_LEVEL_Exported_Functions
  * @{
  */

/**
  * @brief  This method returns the STM32H747I_EVAL BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32H747I_EVAL_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardName(void)
{
  return (uint8_t *)STM32H747I_EVAL_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardID(void)
{
  return (uint8_t *)STM32H747I_EVAL_BSP_BOARD_ID;
}

/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  GPIO_InitTypeDef  gpio_init_structure;

  switch (Led)
  {
    case LED1:
    /* Enable the GPIO_LED clock */
    LED1_GPIO_CLK_ENABLE();
    break;
    case LED2:
     /* Enable the GPIO_LED clock */
    LED2_GPIO_CLK_ENABLE();
    break;
    case LED3:
    /* Enable the GPIO_LED clock */
    LED3_GPIO_CLK_ENABLE();
    break;
    case LED4:
    /* Enable the GPIO_LED clock */
    LED4_GPIO_CLK_ENABLE();
    break;
    default:
    break;
  }
  /* Configure the GPIO_LED pin */
  gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pin = LED_PIN [Led];
  HAL_GPIO_Init(LED_PORT [Led], &gpio_init_structure);
  HAL_GPIO_WritePin(LED_PORT [Led], LED_PIN[Led], GPIO_PIN_SET);

  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;

  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN [Led];
  /* Turn off LED */
  HAL_GPIO_WritePin (LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_PIN_RESET);
  HAL_GPIO_DeInit (LED_PORT [Led], gpio_init_structure.Pin);
  return ret;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_On(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  HAL_GPIO_WritePin (LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_RESET);
  return ret;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led  LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Off(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_WritePin (LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_SET);
  return ret;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_TogglePin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
  return ret;
}

/**
  * @brief  Get the selected LED state.
  * @param  Led LED to be get its state
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval LED status
  */
int32_t BSP_LED_GetState (Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  ret = (int32_t)HAL_GPIO_ReadPin (LED_PORT [Led], (uint16_t)LED_PIN [Led]);
  return ret;
}

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button: Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_USER: User Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  * @retval BSP status
  */
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  static BSP_EXTI_LineCallback ButtonCallback[BUTTONn] ={
                                                          BUTTON_WAKEUP_EXTI_Callback,
                                                          BUTTON_TAMPER_EXTI_Callback,
                                                          BUTTON_USER_EXTI_Callback
                                                        };
  static uint32_t  BSP_BUTTON_PRIO [BUTTONn] ={
                                                BSP_BUTTON_WAKEUP_IT_PRIORITY,
                                                BSP_BUTTON_TAMPER_IT_PRIORITY,
                                                BSP_BUTTON_USER_IT_PRIORITY,
                                              };
  static const uint32_t BUTTON_EXTI_LINE[BUTTONn] ={
                                                     BUTTON_WAKEUP_EXTI_LINE,
                                                     BUTTON_TAMPER_EXTI_LINE,
                                                     BUTTON_USER_EXTI_LINE,
                                                   };
  switch(Button)
  {
   case BUTTON_WAKEUP:
   /* Enable the BUTTON clock*/
   BUTTON_WAKEUP_GPIO_CLK_ENABLE();
   break;
   case BUTTON_TAMPER:
   /* Enable the BUTTON clock*/
   BUTTON_TAMPER_GPIO_CLK_ENABLE();
   break;
   case BUTTON_USER:
   /* Enable the BUTTON clock*/
   BUTTON_USER_GPIO_CLK_ENABLE();
   break;
   default :
   break;
  }
  gpio_init_structure.Pin = BUTTON_PIN [Button];
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;

